# -*- coding: utf-8 -*-
"""
Задание 21.3

Создать функцию parse_command_dynamic.

Параметры функции:
* command_output - вывод команды (строка)
* attributes_dict - словарь атрибутов, в котором находятся такие пары ключ-значение:
 * 'Command': команда
 * 'Vendor': вендор
* index_file - имя файла, где хранится соответствие между командами и шаблонами.
  Значение по умолчанию - "index"
* templ_path - каталог, где хранятся шаблоны. Значение по умолчанию - "templates"

Функция должна возвращать список словарей с результатами обработки
вывода команды (как в задании 21.1a):
* ключи - имена переменных в шаблоне TextFSM
* значения - части вывода, которые соответствуют переменным

Проверить работу функции на примере вывода команды sh ip int br.
"""
import textfsm
from netmiko import ConnectHandler

def parse_command_dynamic(command_output, attributes_dict, index_file='index', templ_path='templates'):
    clitable = textfsm.clitable.CliTable(index_file, templ_path)
    result = []
    clitable.ParseCmd(command_output, attributes_dict)
    for row in clitable:
        result.append(dict(zip(clitable.header, row)))
    return result

# вызов функции должен выглядеть так
if __name__ == "__main__":
    r1_params = {
        "device_type": "cisco_ios",
        "host": "10.0.100.100",
        "username": "cisco",
        "password": "cisco",
        "secret": "cisco",
    }
    with ConnectHandler(**r1_params) as r1:
        r1.enable()
        output = r1.send_command("sh ip int br")
    result = parse_command_dynamic(output, { 'Command': 'sh ip int br', 'Vendor': 'cisco_ios' })
    print(result)
